Repository: 2448986301/AggieGPA
Catalog: AggieGPA/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Open Assignment
zh_hans: 打开作业

source: Open Course
zh_hans: 打开课程

source: Open Exam
zh_hans: 打开考试

source: Open Full Playground
zh_hans: 打开完整模拟

source: Open Full Simulation
zh_hans: 打开完整模拟

source: Open GPA Forecast
zh_hans: 打开 GPA 预测

source: Open Grade Scenario
zh_hans: 打开成绩方案

source: Open score entry for %@
zh_hans: 打开“%@”的录分界面

source: Open Shortcuts
zh_hans: 打开快捷指令

source: Open Source
zh_hans: 开源项目

source: Opening %@ in Aggie GPA.
zh_hans: 正在 Aggie GPA 中打开 %@。

source: Opening GPA forecast in Aggie GPA.
zh_hans: 正在 Aggie GPA 中打开 GPA 预测。

source: Opens final grade settings
zh_hans: 打开最终成绩设置

source: Opens projected grade choices
zh_hans: 打开预计成绩选项

source: Opens target grade settings
zh_hans: 打开目标成绩设置

source: Opens the related course
zh_hans: 打开相关课程

source: opportunities
zh_hans: 项改善机会

source: Optimistic
zh_hans: 冲刺

source: Optional assumed grades
zh_hans: 可选的假设成绩

source: Optional details
zh_hans: 可选信息

source: Optional notes
zh_hans: 可选备注

source: Optional Siri access controls for private GPA data
zh_hans: 可选的私密 GPA 数据 Siri 访问控制

source: Optional. The syllabus stays on this device; deterministic checks and your confirmation still apply.
zh_hans: 可选。课程大纲只留在本机，仍会经过确定性检查并需要你确认。

source: Options for %@
zh_hans: %@ 的更多选项

source: Organizing assignments and exams
zh_hans: 正在整理作业和考试

source: Original Attempt
zh_hans: 原始修读

source: Original Text
zh_hans: 原始文本

source: Other
zh_hans: 其他

source: Other Institution
zh_hans: 其他院校

source: Other UC Campus
zh_hans: 其他 UC 校区

source: Overdue
zh_hans: 已逾期

source: Overview
zh_hans: 概览

source: Page %lld
zh_hans: 第 %lld 页

# Page %lld: %@
source: Page %1$lld: %2$@
zh_hans: 第 %lld 页：%@

source: Page evidence and review flags for every uncertain result
zh_hans: 每项不确定结果均显示来源页码并要求确认

source: Paste syllabus grading rules here
zh_hans: 在此粘贴课程大纲中的评分规则

source: Paste syllabus text
zh_hans: 粘贴课程大纲文本

source: Path to Target
zh_hans: 目标路径

source: Pattern
zh_hans: 命名与日期

source: Paused
zh_hans: 已暂停

source: Peak
zh_hans: 高峰

source: Peak observed memory
zh_hans: 观测到的峰值内存

source: Percent
zh_hans: 百分比

source: Permission
zh_hans: 权限

source: Personal Planning Only
zh_hans: 仅个人规划

source: Plan
zh_hans: 规划

source: Plan basics
zh_hans: 计划基础

source: Plan before grades arrive
zh_hans: 成绩公布前先规划

source: Plan created. Opening Full Simulation.
zh_hans: 计划已创建，正在打开完整模拟。

source: Plan saved
zh_hans: 方案已保存

source: Plan saved. Results will recalculate from your current courses.
zh_hans: 计划已保存，结果会根据当前课程重新计算。

source: Plan your GPA
zh_hans: 规划 GPA

source: Planned
zh_hans: 计划中

source: Please verify these rules against your syllabus.
zh_hans: 请对照课程大纲核对这些规则。

source: Points
zh_hans: 分值

source: Points Based
zh_hans: 按总分计算

source: Positive
zh_hans: 进展良好

source: Possible
zh_hans: 可以达到

source: Possible final range
zh_hans: 预计最终成绩范围

source: Possible points
zh_hans: 总分

source: Possible Points
zh_hans: 满分

source: Possible points are missing.
zh_hans: 缺少可能得分。

source: Power Preference
zh_hans: 电源偏好

source: Predicted final
zh_hans: 预测最终成绩

source: Prefer Battery Life
zh_hans: 优先续航

source: Prefer Quality
zh_hans: 优先质量

source: Preparing Explanation
zh_hans: 正在整理说明

source: Preparing Model
zh_hans: 正在准备模型

source: Preparing Preview…
zh_hans: 正在准备预览……

source: Preparing Result
zh_hans: 正在准备结果

source: Preparing your calendar…
zh_hans: 正在准备学业日历…

source: Preset
zh_hans: 预设

source: Press and hold for details
zh_hans: 按住查看详情

source: Preview
zh_hans: 预览

source: Preview Quick Add
zh_hans: 预览快速添加

source: Preview Transcript
zh_hans: 预览转写内容

source: Preview unavailable
zh_hans: 无法预览

source: Previous Month
zh_hans: 上个月

source: Previous Version
zh_hans: 先前版本

source: Privacy
zh_hans: 隐私

source: Privacy details
zh_hans: 你的学业数据仅保存在本机。Aggie GPA 没有账号系统、分析追踪、广告、远程日志或云同步，也不会主动连接服务器。 导出文件由你自行管理。删除 App 可能会删除本地数据，请定期导出备份。生物识别验证由 iOS 处理，本 App 永远不会接收或保存生物识别数据。

source: Privacy Lock
zh_hans: 隐私锁

source: Privacy overview
zh_hans: 隐私概览

source: Privacy-controlled Siri access and course search improvements.
zh_hans: 受隐私控制的 Siri 访问和课程搜索改进。

source: Private intents require local device authentication. Draft intents never change scores until you confirm inside Aggie GPA.
zh_hans: 私密操作需要本机身份验证。你在 Aggie GPA 内确认之前，草稿操作绝不会修改分数。

source: Productivity
zh_hans: 快捷操作

source: Profile
zh_hans: 个人信息

source: Project
zh_hans: 项目

source: Projected
zh_hans: 预计

source: Projected %@
zh_hans: 预计 %@

source: Projected Cumulative
zh_hans: 预测累计 GPA

source: Projected Current Quarter
zh_hans: 预测当前学期 GPA

source: Projected final
zh_hans: 预测最终成绩

source: Projected GPA
zh_hans: 预计 GPA

source: Projected GPA uses a selected forecast. Courses without one continue using their Current grade.
zh_hans: 预计 GPA 会使用已选择的预测。未选择预测的课程继续沿用当前成绩。

source: Projected GPA uses current coursework and selected forecasts. Final grades replace estimates as they arrive.
zh_hans: 预计 GPA 会结合当前课程成绩和已选择的预测；最终成绩到达后会替代预计值。

source: Projected Grade
zh_hans: 预计成绩

source: Projected term GPA
zh_hans: 预测学期 GPA

source: Projects
zh_hans: 项目

source: Provider
zh_hans: 分析引擎

source: Quantization
zh_hans: 量化

source: Quarter
zh_hans: 学期

source: Quarter GPA
zh_hans: 学期 GPA

source: Quarter GPA trend
zh_hans: 学期 GPA 趋势

source: Quarters
zh_hans: 学期

source: Quarters, courses, scenarios, and grade plans will be removed. Your profile settings remain.
zh_hans: 学期、课程、方案和成绩规划将被移除，个人设置会保留。

source: Quick Add
zh_hans: 快速添加

source: Quick Add Draft
zh_hans: 快速添加草稿

source: Quiz
zh_hans: 小测

source: Quiz 1–5
zh_hans: 小测 1–5

source: Quizzes
zh_hans: 小测

source: Reading syllabus on this device…
zh_hans: 正在本机读取课程大纲…

source: Reading syllabus text
zh_hans: 正在读取课程大纲文字

source: Ready for review
zh_hans: 可以检查

source: Ready to review
zh_hans: 可以开始检查

source: Ready when you are
zh_hans: 准备好就开始吧

source: Rebuild Search Index
zh_hans: 重建搜索索引

source: Recent %@ scores are trending down
zh_hans: 最近的 %@ 成绩持续下降

source: Recognition confidence
zh_hans: 识别置信度

source: Recognition Preview
zh_hans: 识别预览

source: Recognized category weights do not total 100%.
zh_hans: 识别出的类别权重合计不是 100%。

source: Recognized category weights total %@%%, not 100%%. No missing weight was added.
zh_hans: 已识别的类别权重合计为 %@%%，不是 100%%。未自动补充缺失权重。

source: Record courses, units, grades, and GPA trends in one place.
zh_hans: 在一个地方记录课程、学分、成绩和 GPA 趋势。

source: Record Final Grade
zh_hans: 录入最终成绩

source: Record Grade Draft
zh_hans: 录入成绩草稿

source: Record Score
zh_hans: 录入分数

source: Recorded GPA
zh_hans: 记录 GPA

source: Recorded GPA %@
zh_hans: 已记录 GPA %@

source: Recorded GPA: %@
zh_hans: 已记录 GPA：%@

source: Records or updates this score
zh_hans: 录入或更新此分数

source: Refine with On-Device Model
zh_hans: 使用端侧模型优化

source: Release notes unavailable
zh_hans: 暂时没有更新日志

source: Remaining weight
zh_hans: 剩余权重

source: Remaining work with the largest deterministic course influence.
zh_hans: 剩余项目中，对课程总评影响最大的事项。

source: Remind me
zh_hans: 提醒我

source: Reminder
zh_hans: 提醒

source: Reminder date
zh_hans: 提醒日期

source: Reminder lead time
zh_hans: 提醒提前时间

source: Reminder timing is not set.
zh_hans: 未设置提醒时间。

source: Reminders
zh_hans: 提醒

source: Reminders are local to this device and can be enabled per grade item.
zh_hans: 提醒只保存在本机，可为每项作业或考试单独开启。

source: Remove
zh_hans: 移除

source: Remove Category
zh_hans: 移除类别

source: Remove duplicate names or dates before creating items.
zh_hans: 请先移除重复名称或日期，再创建项目。

source: Remove from preview
zh_hans: 从预览中移除

source: Remove Item
zh_hans: 移除项目

source: Rename Template
zh_hans: 重命名模板

source: Repairing the structured result
zh_hans: 正在修复结构化结果

source: Repeat
zh_hans: 重修

source: Repeat course
zh_hans: 重复修读课程

source: Repeated courses
zh_hans: 重复修读课程

source: Replace Current Data
zh_hans: 替换当前数据

source: Request Notification Permission
zh_hans: 请求通知权限

source: Require Face ID, Touch ID, or passcode
zh_hans: 需要 Face ID、Touch ID 或设备密码

source: Required
zh_hans: 所需平均 GPA

source: Required details
zh_hans: 必填信息

source: Required future average: %@
zh_hans: 未来平均需要达到：%@

source: Required future GPA = (target × (current units + future units) − current GPA × current units) ÷ future units.
zh_hans: 所需未来 GPA =（目标 ×（当前学分 + 未来学分）− 当前 GPA × 当前学分）÷ 未来学分。

source: Reset
zh_hans: 恢复默认

source: Reset All Academic Data
zh_hans: 重置全部学业数据

source: Reset all academic data?
zh_hans: 重置全部学业数据？

source: Reset Scenario
zh_hans: 恢复默认方案

source: Resolve the most time-sensitive academic issues first.
zh_hans: 优先处理最需要及时解决的学业问题。

source: Resolved some known issues and improved app stability.
zh_hans: 解决了一些已知问题，并改进应用稳定性。

source: Resolved some known issues.
zh_hans: 解决了一些已知问题。

source: Restore to preview
zh_hans: 恢复到预览

source: Result
zh_hans: 结果

source: Retrying the relevant syllabus section
zh_hans: 正在重试相关课程大纲段落

source: Review
zh_hans: 需要检查

source: Review Grading Policy
zh_hans: 查看评分规则

source: Review Import
zh_hans: 确认导入内容

source: Review the extracted grading information
zh_hans: 请检查提取出的评分信息

source: Reviewable on-device syllabus understanding, now with a native iPad workspace.
zh_hans: 课程大纲会在设备端解析并由你确认，iPad 也提供专用工作区。

source: Reviewable on-device syllabus understanding, with clearer evidence and control.
zh_hans: 设备端课程大纲理解，提供更清晰的来源依据和掌控感。

source: Reviewing grading information locally.
zh_hans: 正在本地检查评分信息。

source: Run Siri Diagnostics
zh_hans: 运行 Siri 诊断

source: Runs On Device
zh_hans: 在设备端运行

source: Safer data migration and backup recovery
zh_hans: 更安全的数据迁移和备份恢复

source: Save
zh_hans: 保存

source: Save and add another
zh_hans: 保存并继续添加

source: Save as Course Template
zh_hans: 保存为课程模板

source: Save Course Template
zh_hans: 保存课程模板

source: Save one from What-If or Future Quarter Planner.
zh_hans: 可从 GPA 试算或未来学期规划中保存方案。

source: Save Plan
zh_hans: 保存计划

source: Save Planning Scenario
zh_hans: 保存规划方案

source: Save Scenario
zh_hans: 保存方案

source: Save this forecast
zh_hans: 保存此预测

source: Save this plan
zh_hans: 保存此方案

source: Save to Records
zh_hans: 保存到正式记录

source: Saved comparisons
zh_hans: 已保存方案对比

source: Saved plans
zh_hans: 已保存方案

source: Saved Plans
zh_hans: 已保存计划

source: Saved Template
zh_hans: 已保存模板

source: Saving a forecast never changes official grades or GPA.
zh_hans: 保存预测不会改变正式成绩或 GPA。

source: Say one sentence with the course, title, deadline, points, and reminder.
zh_hans: 用一句话说出课程、标题、截止时间、分值和提醒。

source: Scan
zh_hans: 扫描

source: Scan Pages
zh_hans: 扫描页面

source: Scenario
zh_hans: 方案

source: Scenario applied to records.
zh_hans: 已将方案写入正式记录。

# Scenario GPA %@ · %lld courses
source: Scenario GPA %1$@ · %2$lld courses
zh_hans: 方案 GPA %@ · %lld 门课程

source: Scenario name
zh_hans: 方案名称

source: Scenario saved. Estimated results were updated; official records were not changed.
zh_hans: 方案已保存，预计结果已更新；正式记录没有改变。

source: Scenarios
zh_hans: 方案

source: Score
zh_hans: 分数

source: Score changes show their effect on course grades and projected GPA
zh_hans: 录入分数后可查看课程成绩和预测 GPA 的变化

source: Score Draft
zh_hans: 成绩录入草稿

source: Score Impact
zh_hans: 成绩影响

source: Score saved
zh_hans: 成绩已保存

source: Search
zh_hans: 搜索

source: Search index
zh_hans: 搜索索引

source: Search Syllabus
zh_hans: 搜索课程大纲

source: Searching local syllabus evidence…
zh_hans: 正在搜索本地课程大纲证据……

source: Searching saved syllabus…
zh_hans: 正在搜索已保存的大纲……

source: Searching Syllabus
zh_hans: 正在搜索课程大纲

source: Second Attempt
zh_hans: 第二次修读

source: See All
zh_hans: 查看全部

source: See how your current course grades affect this term
zh_hans: 查看当前课程成绩如何影响本学期

source: See more
zh_hans: 查看更多

source: See the next deadlines in context.
zh_hans: 在学期进度中查看接下来的截止日期。

source: See where your semester could take you.
zh_hans: 看看这个学期能把你带到哪里。

source: Select a course
zh_hans: 选择课程

source: Select a course template
zh_hans: 选择课程模板

source: Select an area
zh_hans: 选择一个栏目

source: Select an insight
zh_hans: 选择一条提示

source: Selected Day
zh_hans: 选中日期

source: Semester
zh_hans: 学期

source: Semester Dates
zh_hans: 学期日期

source: Semester Map
zh_hans: 学期进度

source: Semester Map organizes dated work by week with course and type filters
zh_hans: 学期进度按周整理已设置日期的任务，并支持按课程和类型筛选

source: Semester Map uses these dates and never guesses your academic calendar.
zh_hans: 学期进度会严格使用这些日期，不会猜测你的校历。

source: Set a target
zh_hans: 设置目标

source: Set a target first
zh_hans: 请先设置目标

source: Set It Up Manually
zh_hans: 手动设置

source: Set Projected Grade
zh_hans: 设置预计成绩

source: Set Reminder
zh_hans: 设置提醒

source: Set reminders
zh_hans: 设置提醒

source: Set Semester Dates
zh_hans: 设置学期日期

source: Set target
zh_hans: 设置目标

source: Set the finish line first
zh_hans: 先设定目标

source: Set Up Grade Breakdown
zh_hans: 设置成绩构成

source: Settings
zh_hans: 设置

source: Share latest JSON backup
zh_hans: 分享最新 JSON 备份

source: Show Details
zh_hans: 查看详情

source: Show extracted text
zh_hans: 显示提取的文本

source: Show fewer courses
zh_hans: 收起课程

source: Show Major GPA
zh_hans: 显示专业 GPA

source: Show repeat summary
zh_hans: 显示重复修读摘要

source: Show Upper-Division GPA
zh_hans: 显示高年级课程 GPA

source: Simpler assignment, exam, and score-entry flows
zh_hans: 更简洁的作业、考试和分数录入流程

source: Simulated courses
zh_hans: 模拟课程

source: Siri & Shortcuts
zh_hans: Siri 与快捷指令

source: Siri & Shortcuts Access
zh_hans: Siri 与快捷指令访问权限

source: Siri access is off by default. Each category of private data must be enabled explicitly.
zh_hans: Siri 访问默认关闭，每类私密数据都必须单独开启。

source: Siri Aliases
zh_hans: Siri 常用名称

source: Siri Diagnostics
zh_hans: Siri 诊断

source: Siri Draft
zh_hans: Siri 草稿

source: Some dates match existing records.
zh_hans: 有些日期与已有记录重复。

source: Some grading details need confirmation because the analysis confidence is low.
zh_hans: 部分评分信息的识别把握较低，需要你确认。

source: Some grading details need review before import.
zh_hans: 导入前需要检查部分评分信息。

source: Some items need your review
zh_hans: 部分内容需要你确认

source: Source
zh_hans: 来源

source: Source Course
zh_hans: 来源课程

source: Source Preview
zh_hans: 原文预览

source: Spotlight indexing for courses
zh_hans: 课程的 Spotlight 索引

source: Spring
zh_hans: 春季

source: Start Date
zh_hans: 开始日期

source: Start using Aggie GPA
zh_hans: 开始使用 Aggie GPA

source: Starting academic year
zh_hans: 起始学年

source: Starting number
zh_hans: 起始编号

source: Starts
zh_hans: 开始

source: Status
zh_hans: 状态

source: Storage
zh_hans: 存储

source: Storage Used
zh_hans: 已用存储

source: Submitted
zh_hans: 已提交

source: Suggested method
zh_hans: 建议方式

source: Summer Session I
zh_hans: 夏季学期 I

source: Summer Session II
zh_hans: 夏季学期 II

source: Summer Special Session
zh_hans: 夏季特别学期

source: Swipe left for score, editing, and deletion actions.
zh_hans: 向左轻扫以显示录分、编辑和删除操作。

source: Swipe right to record or edit the score. Swipe left to delete. Long press to edit assignment details.
zh_hans: 向右轻扫可录入或修改成绩，向左轻扫可删除，长按可编辑作业信息。

source: Switches between assignments, grade breakdown, and goal estimate
zh_hans: 在作业、成绩构成和目标试算之间切换

source: Switches between overview, assignments, grade breakdown, and goal estimate
zh_hans: 在概览、作业、成绩构成和目标试算之间切换

source: Syllabus
zh_hans: 课程大纲

source: Syllabus analysis is performed on device. You review every proposed category, weight, assessment, and rule before anything is written to your course data.
zh_hans: 课程大纲分析在设备端完成。在任何内容写入课程数据之前，你都会核对每一项建议的类别、权重、考核项目和规则。

source: Syllabus analysis uses the official llama.cpp XCFramework under the MIT License. The runtime executes inside Aggie GPA and does not send syllabus text to a server.
zh_hans: 课程大纲分析使用采用 MIT 许可证的官方 llama.cpp XCFramework。推理过程在 Aggie GPA 内运行，不会把课程大纲文字发送到服务器。

source: Syllabus Evidence
zh_hans: 引用依据

source: Syllabus import
zh_hans: 课程大纲导入

source: Syllabus Source
zh_hans: 课程大纲来源

source: Syllabus text stays on this iPhone or iPad. No account, API key, cloud inference, or Apple Intelligence is used.
zh_hans: 课程大纲只保留在这台设备上，无需登录，也不会上传。

source: System
zh_hans: 跟随系统

source: Tap a grade for an immediate, private simulation
zh_hans: 点一下成绩，立即进行不会改动记录的模拟

source: Target
zh_hans: 目标

source: Target and scope
zh_hans: 目标与范围

source: Target course percentage
zh_hans: 目标课程百分比

source: Target GPA
zh_hans: 目标 GPA

source: Target Grade
zh_hans: 目标成绩

source: Target is reachable
zh_hans: 目标可达

source: Target needs a stronger plan
zh_hans: 目标需要更强的计划

source: Target overall percentage
zh_hans: 目标总评百分比

source: Target Percentage
zh_hans: 目标百分比

source: Target percentage (optional)
zh_hans: 目标百分比（可选）

source: Target reached
zh_hans: 已达到目标

source: Target: %@
zh_hans: 目标：%@

source: Template
zh_hans: 模板

source: Template name
zh_hans: 模板名称

source: Template Preview
zh_hans: 模板预览

source: Term
zh_hans: 学期类型

source: Terms, courses, official GPA, and planning tools
zh_hans: 学期、课程、正式 GPA 与规划工具

source: The calculated current result is already at or above %@.
zh_hans: 当前计算结果已达到或超过 %@。

source: The calculation engine requires category weights to total 100%%; current total: %@.
zh_hans: 计算引擎要求类别权重总和为 100%%；当前总和：%@。

source: The cited syllabus text answers "%@". Check the page before relying on it.
zh_hans: 下面引用的大纲内容回答了“%@”。使用前请先查看对应页码。

source: The common scale is only a starting template. Confirm it matches this syllabus before relying on letter predictions.
zh_hans: 常见分数线仅是起始模板。使用字母成绩预测前，请确认它与课程大纲一致。

source: The comparison uses the three most recent scored items in this category.
zh_hans: 比较使用此类别最近三个已评分项目。

source: The confirmed import could not be saved: %@
zh_hans: 无法保存已确认的导入内容：%@

source: The conflict-reconciliation pass could not resolve every grading detail. Review the source before importing.
zh_hans: 冲突协调步骤无法解决所有评分细节。导入前请查看原文。

source: The course has no enabled confirmed grade scale.
zh_hans: 课程没有已启用且已确认的等级分数表。

source: The current language is not supported by the on-device model.
zh_hans: 设备端模型不支持当前语言。

source: The downloaded local model is incomplete or invalid. Download it again.
zh_hans: 下载的本地模型不完整或无效，请重新下载。

source: The drop rule removes every item in %@.
zh_hans: 当前舍弃规则会移除 %@ 中的所有项目。

source: The hybrid policy needs direct-point items.
zh_hans: 混合计分方式需要至少一个直接按分数计算的项目。

source: The last three recorded scores moved from %@ to %@ to %@.
zh_hans: 最近三次已记录成绩从 %@ 降至 %@，再降至 %@。

source: The local model could not be downloaded. Check your connection and try again.
zh_hans: 无法下载本地模型。请检查网络连接后重试。

source: The local model did not return a valid grading structure. Review the syllabus manually or analyze it again.
zh_hans: 本地模型未生成有效的评分结构。请手动核对课程大纲，或重新分析。

source: The local model reads text extracted by PDFKit. Scanned pages without embedded text can still be entered manually.
zh_hans: 课程大纲文字会在本机读取；扫描页也可以手动录入。

source: The local model returned an incomplete Quick Add draft.
zh_hans: 本地模型返回的快速添加草稿不完整。

source: The local model was unavailable, so a manual fallback was prepared.
zh_hans: 本地模型不可用，已准备手动回退结果。

source: The matching grade item no longer exists.
zh_hans: 对应的作业或考试已不存在。

source: The model download was interrupted. Check your connection and try again.
zh_hans: 模型下载已中断。请检查网络连接后重试。

source: The offline GPA planner foundation.
zh_hans: 离线 GPA 规划工具的基础版本。

source: The on-device model is not ready.
zh_hans: 设备端模型尚未准备好。

source: The on-device model is unavailable on this device.
zh_hans: 此设备无法使用设备端模型。

source: The open-source local model runtime is not linked in this build.
zh_hans: 此版本暂时无法使用本地模型。

source: The Quick Add draft could not be saved.
zh_hans: 无法保存快速添加草稿。

source: The recorded score changed this estimate. Your official course grade was not changed.
zh_hans: 新记录的分数改变了这项估算，但没有改动正式课程成绩。

source: The remaining work needs an average of %@.
zh_hans: 剩余工作需要平均达到 %@。

source: The saved grade-item status is Missing.
zh_hans: 已保存的成绩项目状态为“缺交”。

source: The selected course is no longer available.
zh_hans: 所选课程已不可用。

source: The selected GGUF model could not be copied into Aggie GPA.
zh_hans: 无法将所选 GGUF 模型导入 Aggie GPA。

source: The selected syllabus could not be read.
zh_hans: 无法读取所选课程大纲。

source: The selected target is not reachable under these assumptions.
zh_hans: 按照当前试算设置，无法达到所选目标。

source: The syllabus mixes percentage weights and points. Confirm how the course calculates grades.
zh_hans: 课程大纲同时使用了百分比权重和积分，请确认这门课的成绩计算方式。

source: The text was found, but the grading breakdown is not confirmed yet. Review it before saving.
zh_hans: 已找到文本，但评分构成还未确认。保存前请先检查。

source: Thermal state
zh_hans: 设备温度状态

source: These are private planning inputs, not final records
zh_hans: 这些只是私下规划输入，不是最终记录

source: This action cannot be undone from this screen. Export a backup first if needed.
zh_hans: 此操作无法在当前页面撤销。如有需要，请先导出备份。

source: This app does not determine official academic standing, graduation eligibility, repeat-course notation, transfer credit, major requirements, or Registrar decisions.
zh_hans: 本 App 无法决定正式学业状态、毕业资格、重复课程注记、转学分认定、专业要求或 Registrar 的最终决定。

source: This app version does not have release notes yet.
zh_hans: 此 App 版本暂时没有更新日志。

source: This assignment already has a recorded score. Delete it?
zh_hans: 这项作业已录入分数。要删除吗？

source: This assignment will be deleted.
zh_hans: 这项作业将被删除。

source: This build does not request microphone access. The transcript handoff is ready for review while the real-device speech audit remains open.
zh_hans: 此版本不会请求麦克风权限。真机语音审核仍在进行，但转写交接流程已经可以检查。

source: This course already has categories. To avoid silently overwriting entered work, merge the recognized rules manually.
zh_hans: 这门课已有类别。为避免覆盖已输入内容，请手动合并识别出的规则。

source: This course already has grading data. Confirm & Import adds only reviewed, non-duplicate records and does not replace existing grades.
zh_hans: 这门课已有评分数据。“确认并导入”只会添加你核对过且不重复的内容，不会替换现有成绩。

source: This course already has grading data. Confirm Import will add only the reviewed categories and assessments; it will not replace existing records.
zh_hans: 此课程已有评分数据。确认导入只会添加已确认的类别和细分项目，不会替换现有记录。

source: This course has no assignment or exam records.
zh_hans: 此课程没有作业或考试记录。

source: This demo is temporary and never writes to SwiftData.
zh_hans: 此示例是临时的，绝不会写入 SwiftData。

source: This is a repeat attempt
zh_hans: 这是一次重复修读

source: This is an estimate based on your setup and recorded scores. It is not an official final grade.
zh_hans: 这是基于当前设置和已录入分数的估算，不是正式最终成绩。

source: This item is due within 7 days and can affect about %@ of the calculated course result.
zh_hans: 此项目将在 7 天内截止，可能影响计算课程结果约 %@。

source: This local model needs text from a text-based PDF or pasted syllabus. You can still enter the grading method manually.
zh_hans: 本地模型需要可提取文字的 PDF，或你粘贴的课程大纲内容。你仍可手动录入评分方式。

source: This model cannot analyze scanned pages. You can paste text or create the grading method manually.
zh_hans: 当前模型无法分析扫描页面。你可以粘贴文字，或手动设置评分方式。

source: This quarter, based on courses currently included in GPA.
zh_hans: 本学期数据基于当前计入 GPA 的课程。

source: This scenario is stored locally and can be changed without altering entered scores.
zh_hans: 此方案只保存在本机，修改它不会改变已录入的分数。

source: This semester has ended
zh_hans: 这个学期已经结束

source: This semester has not started yet
zh_hans: 这个学期还未开始

source: This single item contributes about %@ of the calculated course result when it is included.
zh_hans: 计入时，此单项约占计算课程结果 %@。

source: This syllabus section is too long for the local model. Try a shorter PDF or paste the grading section.
zh_hans: 这部分课程大纲超出本地模型的处理长度。请使用更短的 PDF，或只粘贴评分说明。

source: This target is not mathematically reachable within the selected number of future units if the maximum future GPA is 4.0.
zh_hans: 若未来最高 GPA 为 4.0，则在所选未来学分内无法从数学上达到该目标。

source: This target is not reachable with the selected future units.
zh_hans: 按照所选未来学分，无法达到这个目标。

source: This term
zh_hans: 本学期

source: This term GPA
zh_hans: 本学期 GPA

source: This text document format is not supported. Paste its text instead.
zh_hans: 不支持这种文本文档格式，请改为粘贴其中的文字。

source: This writes simulated grades to your official course records.
zh_hans: 这会将模拟成绩写入正式课程记录。

source: Time-sensitive
zh_hans: 时间提醒

source: Tinted
zh_hans: 着色

source: Title
zh_hans: 名称

source: Today
zh_hans: 今天

source: Today highlights up to three reliable tasks to focus on next
zh_hans: “今天”最多会提示三项当前最值得关注的任务

source: Total
zh_hans: 总计

source: Total points
zh_hans: 总分制

source: Track every quarter
zh_hans: 记录每个学期

source: Transcribing
zh_hans: 正在转写

source: Transfer course
zh_hans: 转学课程
